Revit 2024 API
ExportFontKey Members
The ExportFontKey type exposes the following members.
Constructors
Name | Description
ExportFontKey()
 Constructs a new default ExportFontKey.
ExportFontKey(String)
 Constructs a new ExportFontKey using an input font name.
ExportFontKey(ExportFontKey)
 Constructs a new copy of the input ExportFontKey object.
Methods
Name | Description
Dispose
Releases all resources used by the ExportFontKey
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OriginalFontName
 The original font name.
See Also
ExportFontKey Class
Autodesk.Revit.DB Namespace